{
  "backend/main.mo": "Motoko canister defining chat logic, user profiles, media storage, emojis, and authorization mixins with join and profile update functionality.",
  "feature_evidence.json": "Feature evidence report listing branding‑related deployment verification files, components, and test references for Version 33.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files used in the project.",
  "frontend/DEPLOYMENT-BRANDING-CHECKLIST.md": "Deployment checklist ensuring correct branding assets and HTML title for Version 33 before release.",
  "frontend/index.css": "Global Tailwind stylesheet defining color tokens, dark mode variants, and base element styling.",
  "frontend/index.html": "Main HTML entry file setting title “Dini GC” and linking favicon and apple‑touch‑icon assets.",
  "frontend/scripts/verify-branding-assets.ts": "Node script verifying index.html branding title and icon paths and ensuring required asset files exist.",
  "frontend/src/App.tsx": "Root React component that loads or stores user profile in sessionStorage and switches between JoinScreen and ChatScreen.",
  "frontend/src/components/ChatScreen.tsx": "Main chat UI handling messages, media uploads, profile editing, GIFs, emojis, and auto‑scroll behavior.",
  "frontend/src/components/EmojiPicker.tsx": "Component for browsing and selecting custom emojis and uploading new emoji images with validation and server mutation.",
  "frontend/src/components/GifPicker.tsx": "GIF picker that loads trending or searched GIPHY results and lets users select a GIF URL.",
  "frontend/src/components/JoinScreen.tsx": "User onboarding screen handling username entry, optional profile picture upload, and user creation via backend.",
  "frontend/src/components/MessageItem.tsx": "Renders a chat message with avatar, timestamp, text, emojis, and media, adjusting layout for own vs others’ messages.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and auth client initialization.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching messages, counts, default pictures, and for sending messages and uploading media via the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles and a light‑mode theme using OKLCH variables with a custom font.",
  "frontend/src/lib/config.ts": "Exports app config including GIPHY API key, endpoints, and default query params.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Metadata describing project state, requirements, issues, and branding/deployment tasks for the Dini GC project."
}