{
  "backend/main.mo": "Chat backend actor handling users, messages, media, emojis, and authorization using maps and storage mixins with join and profile update logic.",
  "feature_evidence.json": "Feature evidence report describing a favicon replacement feature, its components, and test coverage.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files and their recent UI, color, and behavior updates.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry with title and links to generated favicon assets and main script root.",
  "frontend/src/App.tsx": "Main React app managing user session, join flow, profile updates, and theme provider setup.",
  "frontend/src/components/ChatScreen.tsx": "Full chat interface handling messages, media uploads, emoji/GIF pickers, profile editing, and real‑time updates.",
  "frontend/src/components/EmojiPicker.tsx": "Emoji picker allowing browsing and uploading emoji images with validation and live preview.",
  "frontend/src/components/GifPicker.tsx": "GIF picker component that loads trending GIFs, supports searching via Giphy API, and lets users select a GIF.",
  "frontend/src/components/JoinScreen.tsx": "User onboarding form handling username input, optional profile picture upload, and user creation with error handling.",
  "frontend/src/components/MessageItem.tsx": "Displays a chat message with avatar, timestamp, text, emojis, and media, adjusting layout for own vs. others’ messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for messages, media uploads, sending messages, profiles, emojis, and default pictures using the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers and sets a light theme using OKLCH variables plus the Fredoka One font.",
  "frontend/src/lib/config.ts": "Exports app config for GIPHY API usage including key, endpoints, and default query params.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, then renders App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors from CSS variables, plugins, and custom animations.",
  "project_state.json": "Tracks project metadata, feature requirements, favicon updates, and pending requests for the Dini GC project."
}