{
  "backend/main.mo": "Main Motoko actor implementing chat logic, user profiles, message storage, and authorization/mixin integration with state maps and CRUD operations.",
  "backend/migration.mo": "Migration module converting old user profiles to include a new theme field while preserving all other stored data.",
  "feature_evidence.json": "Feature evidence report describing the theme‑toggle feature, affected frontend files, components, and test coverage.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend source files used for reference in build planning.",
  "frontend/DEPLOYMENT-BRANDING-CHECKLIST.md": "Checklist document ensuring correct branding assets, titles, and icons before deployment.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH light/dark theme tokens and base UI variables.",
  "frontend/index.html": "HTML entry point setting document metadata, branding icons, and an early script to initialize light/dark theme before React loads.",
  "frontend/scripts/verify-branding-assets.ts": "Node script validating that branding assets and HTML references exist and match required values during deployment.",
  "frontend/src/App.tsx": "Root React component managing stored user profile state and switching between JoinScreen and ChatScreen.",
  "frontend/src/components/ChatScreen.tsx": "Chat UI component handling message sending, rendering, profile updates, and displaying settings and header UI.",
  "frontend/src/components/EmojiPicker.tsx": "Empty placeholder file for the custom emoji picker component.",
  "frontend/src/components/GifPicker.tsx": "Empty placeholder file for the GIF picker component.",
  "frontend/src/components/JoinScreen.tsx": "User join UI handling username entry, optional image upload, error checks, and triggering user creation.",
  "frontend/src/components/MessageItem.tsx": "Renders a chat message with avatar, timestamp formatting, and styling for own vs others' messages.",
  "frontend/src/components/SettingsDialog.tsx": "Dialog for editing username, profile picture, and theme with upload validation and profile update calls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state via Internet Identity with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for messages, users, sending messages, profile updates, and picture handling via the actor.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and DOM class updates.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light/dark modes with custom color tokens.",
  "frontend/src/lib/config.ts": "Defines Giphy API config including API key, endpoints, and default params.",
  "frontend/src/lib/theme.ts": "Exports the default app theme set to light mode.",
  "frontend/src/main.tsx": "Bootstraps the React app using React Query and the InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL and sessionStorage parameters with hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, spacing, animations, and plugins for the UI theme.",
  "project_state.json": "Tracks project versioning, requirements, issues, and constraints for restoring Version 35 with a theme toggle."
}