{
  "backend/main.mo": "Motoko canister implementing chat features including users, messages, media, emojis, and profile management with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report describing favicon-related requirements, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend source files and their recent UI or logic changes.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML entry point defining title, favicon links, root container, and module script for the frontend app.",
  "frontend/src/App.tsx": "Main React component managing session-backed user profile state and conditionally rendering JoinScreen or ChatScreen.",
  "frontend/src/components/ChatScreen.tsx": "Full chat interface handling messages, media uploads, profile editing, emoji/GIF pickers, and auto-scrolling behavior.",
  "frontend/src/components/EmojiPicker.tsx": "Emoji picker UI allowing browsing and uploading custom emoji images with validation and mutation calls.",
  "frontend/src/components/GifPicker.tsx": "React GIF picker that loads trending or searched GIFs from Giphy and returns a selected URL.",
  "frontend/src/components/JoinScreen.tsx": "User onboarding form that handles username entry, optional profile picture upload, and user creation.",
  "frontend/src/components/MessageItem.tsx": "Renders an individual chat message with avatar, timestamp, text, emojis, and media.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, state management, and persistence.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for messages, counts, media upload, sending messages, and loading default pictures.",
  "frontend/src/index.css": "Defines global Tailwind layers and sets a light‑mode theme using OKLCH CSS variables with a custom font.",
  "frontend/src/lib/config.ts": "Provides GIPHY API configuration including endpoints, defaults, and a dev API key.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Metadata describing project state, feature requirements, favicon needs, and pending domain/title updates."
}