{
  "kind": "build_request",
  "title": "Build and deploy Version 35 baseline with Light mode default + Settings theme toggle",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Create and deploy a new draft build that matches the Version 35 baseline UI/behavior end-to-end (Join flow + Chat flow) with the only functional addition being a Light/Dark theme toggle inside the existing Settings (Edit Profile) dialog after entering chat; the app must load in Light mode by default regardless of OS/system theme, and any user can toggle between Light and Dark using that Settings toggle.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "start building (also make the whole website to light mode and anyone can toggle it to dark or from dark to light)"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load with no saved theme preference, the site renders in Light mode (no dark styling), regardless of the user's OS/system theme.",
        "The Light/Dark toggle is available only inside the existing Settings (Edit Profile) dialog in the Chat header (i.e., after joining/entering chat), and it switches the UI between light and dark themes.",
        "Toggling the theme does not remove, hide, replace, or rearrange any Version 35 UI elements or flows on the Join screen or Chat screen aside from theme styling changes.",
        "Theme preference persists across page reloads via localStorage; clearing localStorage resets the app to Light mode on next load.",
        "No additional new UI controls, screens, or features are introduced beyond the Settings theme toggle; the rest of the app matches Version 35 behavior and layout."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add a migration (backend/migration.mo) if state changes require it.",
    "Do not add, remove, or rearrange any UI/functionality relative to Version 35 except for the existing Light/Dark toggle inside Settings after entering chat.",
    "Default theme on initial load must be Light mode (not system/OS-driven)."
  ],
  "nonGoals": [
    "Custom domain setup (e.g., dinigc.com) or any DNS/domain linking changes.",
    "Adding new authentication providers beyond Internet Identity.",
    "Adding any new features unrelated to restoring Version 35 baseline and the Settings theme toggle."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}