{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Version 35 baseline: Light mode default + Settings theme toggle (persisted)",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Ensure Version 35 Join + Chat flows remain unchanged while enforcing Light mode by default and providing a persisted Light/Dark toggle only inside the existing Settings (Edit Profile) dialog in Chat.",
      "acceptanceCriteria": [
        "On a fresh load with no saved theme preference, the site renders in Light mode (no dark styling), regardless of the user's OS/system theme.",
        "The Light/Dark toggle is available only inside the existing Settings (Edit Profile) dialog in the Chat header (i.e., after joining/entering chat), and it switches the UI between light and dark themes.",
        "Toggling the theme does not remove, hide, replace, or rearrange any Version 35 UI elements or flows on the Join screen or Chat screen aside from theme styling changes.",
        "Theme preference persists across page reloads via localStorage; clearing localStorage resets the app to Light mode on next load.",
        "No additional new UI controls, screens, or features are introduced beyond the Settings theme toggle; the rest of the app matches Version 35 behavior and layout."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add an early (pre-React) theme initialization script that sets documentElement theme class based on localStorage (defaulting to Light) to guarantee Light mode on first paint regardless of OS/system theme and to avoid any dark-mode flash."
        },
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "modify",
          "description": "Harden theme state management to use the centralized DEFAULT_THEME, read/write the existing localStorage theme preference, and always apply exactly one theme class (light/dark) to documentElement. Ensure clearing localStorage results in Light mode on next load."
        },
        {
          "path": "frontend/src/components/SettingsDialog.tsx",
          "operation": "modify",
          "description": "Confirm the theme toggle remains only within this existing Settings (Edit Profile) dialog and is wired to useTheme without introducing any additional UI controls. Use the existing shadcn-ui Switch component to provide the toggle behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}